[
  {
    "bgColor":"red-bg",
    "title":"Amorae Bridal",
    "titleImage":"/img/amorae/desktop-homepage-mock-up.png",
    "role":"Design & Development",

    "challengeText":"Amorae Bridal is an award winning bridal shop located in Essex. Amorae wanted a responsive web solution that would allow their clients to easily get in touch. It was also important for them to feature pictures of their brides on their site without the use of a gallery feature.",

    "parallax":"amorae-parallax",
    "processHeading":"It begins on paper",

    "processText":"The discovery stage is the most important step in the process. This generally starts on paper and outlines the who, what and why. Who will be using this product, why they will use this product and what they will get from it. Once established I moved onto wireframes, user-flow and design.",

    "processLeftImg":"/img/amorae/wireframe-sketch.jpg",
    "processLeftImgCaption":"Landing page discovery process",
    "processRightImg":"/img/amorae/user-flow-image.jpg",
    "processRightImgCaption":"User flow and experience",

    "buildProcessHeading":"The Build Process",
    "buildProcessText":"The discovery stage revealed that each of the products page will have the same layout. This lead my decision to use a HTML template for each the product pages which allowed for super easy maintenance.",

    "buildProcessLeftImg":"/img/amorae/code-window.png",
    "buildProcessRightImg":"/img/amorae/page-in-browser.png",

    "caseStudyFooter":"caseStudyFooter",
    "conclusionHeading":"The icing on the cake",
    "conclusionText":"Amorae wanted to maintain a positive relationship with their clients after their wedding. We built the homepage as a fullscreen image carousel populated with images of their brides. This gave Amorae an opportunity to keep in touch and also promote their website long after their clients wedding. Amorae are delighted with their new website and we're continuing to work together.",
    "conclusionImg":"/img/amorae/ipad-animate.gif",
    "conclusionImgCaption":"Example of fullscreen background carousel (speed x 2)",

    "footerDesktopImg":"/img/amorae/desktop-mock-up.png",
    "footerPhoneImg":"/img/amorae/iphone-mock-up.png",
    "footerIpadImg":"/img/amorae/ipad-mock-up.png"
  },

  {
    "bgColor":"blueviolet-bg",
    "title":"Sandhills Videography",
    "titleImage":"/img/sandhills/title-image.png",
    "role":"UI/UX Design",

    "challengeText":"I was in contact with a developer from California who asked me to collaborate on a project. I was asked to redesign a 9 page website and condense it into a one page responsive experience. Communication was difficult with the time difference so we scheduled a couple of skype calls to discuss the project.",

    "parallax":"sandhills-parallax",
    "processHeading":"Discovery Stage",
    "processText":"As with most of my projects, I started on paper. I went through the old website and labeled each section of content in order of importance. We discussed and tweaked our wireframes on paper and finalised the design in Sketch.",

    "processLeftImg":"/img/sandhills/wireframe.jpg",
    "processLeftImgCaption":"Paper wireframes",
    "processRightImg":"/img/sandhills/design-sketch-app.jpg",
    "processRightImgCaption":"Design in Sketch",

    "buildProcessHeading":"The Final design",
    "buildProcessText":"The finished product. Both Mark (the developer) and I are really happy with the completed design. Mark presented it to the client and received some superb feedback.",
    "quote":"Absolutely love it! You guys have been awesome to work with, this is everything I hoped for and more. I've already had enquiries from my website and I have you guys to thank.",
    "finalDesign":"finalDesign"
  },

  {},

  {
    "bgColor":"lightskyblue-bg",
    "title":"Marshmallow & Mammy",
    "titleImage":"/img/marshmallow-and-mammy/title-image.png",
    "role":"Design & Development",

    "challengeText":"Marshmallow & Mammy is a personal project to follow along with my partner and I as we go through our first pregnancy together. The challenge with this project was to build a fully functioning application within 24 hours. My goal was for an interactive blog style website that will allow users to sign up for email notifications.",

    "parallax":"marshmallow-parallax",
    "processHeading":"Good old pen & paper",
    "processText":"Preparation is key, especially with a 24 hour deadline. This required a short research & development stage. I set aside 2 hours for research, wireframes and design. I wanted the site to be colourful, simple to navigate and engaging for the user.",

    "processLeftImg":"/img/marshmallow-and-mammy/wireframe-sketch.jpg",
    "processLeftImgCaption":"Research & final wireframes",
    "processRightImg":"/img/marshmallow-and-mammy/design-sketch-app.jpg",
    "processRightImgCaption":"UI design using Sketch",

    "buildProcessHeading":"The Build Process",
    "buildProcessText":"I built this project as a SPA (single page application), this allowed me to increase the performance and keep load times to a minimum. I used json files to maintain the applications data and Angular directives/components to create modular/reusable content sections.",

    "buildProcessLeftImg":"/img/marshmallow-and-mammy/build-process-left.jpg",
    "buildProcessRightImg":"/img/marshmallow-and-mammy/build-process-right.jpg",

    "caseStudyFooter":"caseStudyFooter",
    "conclusionHeading":"Conclusion",
    "conclusionText":"Victory! I completed my goal. A fully responsive SPA that allows user to sign up for email notifications. I chose Mailchimp to manage the user subscriptions. To add some interactivity I created an Angular directive that would make image swaps really simple.",
    "conclusionImg":"/img/marshmallow-and-mammy/marshmallow-animate.gif",
    "conclusionImgCaption":"Example of interactive images",

    "footerDesktopImg":"/img/marshmallow-and-mammy/footer-desktop-mock-up.png",
    "footerPhoneImg":"/img/marshmallow-and-mammy/footer-iphone-mock-up.png",
    "footerIpadImg":"/img/marshmallow-and-mammy/footer-ipad-mock-up.png"
  },

  {},

  {
    "bgColor":"royalblue-bg",
    "title":"Slievemore Clinic",
    "titleImage":"/img/slievemore/title-image-mock-up.png",
    "role":"Design & Development",

    "challengeText":"Slievemore Clinic is a modern, multi-disciplinary healthcare facility based in Ireland. The goal for this project was to create an easy to use website and a friendly experience for all. Slievemore houses 16+ clinics that are all accessed by different types of users, This was a key factor during the discovery stage. Slievemore also wanted to maintain and edit the website themselves, this called for a friendly CMS.",

    "parallax":"slievemore-parallax",
    "processHeading":"Discovery Stage",
    "processText":"Like the majority of my projects this one started with pen and paper. It was very important to the Slievemore team to have a mobile friendly website. With this in mind I decided to take the 'mobile first' approach and start wireframing the mobile version of the site and build on it with each revision.",

    "processLeftImg":"/img/slievemore/mobile-first-sketch.jpg",
    "processLeftImgCaption":"Mobile first wireframes",
    "processRightImg":"/img/slievemore/desktop-sketch.jpg",
    "processRightImgCaption":"Early desktop wireframes",

    "buildProcessHeading":"The Build Process",
    "buildProcessText":"I built this project using Wordpress and chose the Divi theme because of how simple it's 'drag & drop' builder is for clients. At Slievemore they have both experienced and inexperienced staff that will maintain the website so these elements are beneficial to all.",

    "buildProcessLeftImg":"/img/slievemore/build-process-left.png",
    "buildProcessRightImg":"/img/slievemore/build-process-right.png",

    "caseStudyFooter":"caseStudyFooter",
    "conclusionHeading":"Conclusion",
    "conclusionText":"Our goals were reached! Slievemore are extremely happy with their new website and we met all their requirements. They have found it super easy to edit content and have had a huge increase in client engagement. This project was so successful we're now working on a new project together.",
    "conclusionImg":"/img/slievemore/conclusion.gif",
    "conclusionImgCaption":"Slievemore photo gallery",

    "footerDesktopImg":"/img/slievemore/footer-desktop-mock-up.png",
    "footerPhoneImg":"/img/slievemore/footer-iphone-mock-up.png",
    "footerIpadImg":"/img/slievemore/footer-ipad-mock-up.png"
  }
]
